[
{
"Lagna (Ascendant)": "Aries",
"Ruling Planet": "Mars",
"Interpretation": "You are ruled by Mars, giving you a dynamic and athletic build with a direct gaze. You are the Pioneer—impulsive, courageous, and fiercely independent. Characterized by a long face and neck, you possess a quick-witted nature and are fond of travel, though you focus intensely on starting new projects and blazing trails."
},
{
"Lagna (Ascendant)": "Taurus",
"Ruling Planet": "Venus",
"Interpretation": "You are ruled by Venus, manifesting in a sturdy build with beautiful features and magnetic eyes. You are the Sustainer—stable, practical, and focused on security. You possess great patience in adversity but can be resistant to rapid change, valuing material luxury and a calm, slow demeanor."
},
{
"Lagna (Ascendant)": "Gemini",
"Ruling Planet": "Mercury",
"Interpretation": "You are ruled by Mercury, giving you a tall, slender, and youthful appearance with restless eyes. You are the Communicator—scientific, curious, and ambitious for fame. While your mind is quick and ready-witted, you are prone to multitasking and must guard against nervous breakdowns by cultivating self-control."
},
{
"Lagna (Ascendant)": "Cancer",
"Ruling Planet": "Moon",
"Interpretation": "You are ruled by the Moon, appearing with a middle-sized body and a full, white complexion. You are the Nurturer—highly intelligent, frugal, and deeply attached to home and family. Your extreme sensitiveness makes you intuitive and protective, though you may encounter mood swings or nervous anxiety."
},
{
"Lagna (Ascendant)": "Leo",
"Ruling Planet": "Sun",
"Interpretation": "You are ruled by the Sun, possessing a majestic appearance, broad shoulders, and a bold temperament. You are the Leader—independent, respectful, and ambitious. You have a natural knack for adapting to any condition of life and are often a voracious reader with a noble spirit."
},
{
"Lagna (Ascendant)": "Virgo",
"Ruling Planet": "Mercury",
"Interpretation": "You are ruled by Mercury, with a well-formed body and a ruddy complexion. You are the Analyzer—possessing a strong memory and acute intelligence. You are emotional yet discriminating, with a natural taste for fine arts, and you approach life with precision and a focus on service."
},
{
"Lagna (Ascendant)": "Libra",
"Ruling Planet": "Venus",
"Interpretation": "You are ruled by Venus, appearing with a fair complexion and handsome features. You are the Idealist—valuing truth, honesty, and harmony above all else. You possess a keen power of observation and exert a great deal of influence through your just and balanced approach to leadership."
},
{
"Lagna (Ascendant)": "Scorpio",
"Ruling Planet": "Mars",
"Interpretation": "You are ruled by Mars, giving you a youthful appearance with fierce eyes and a dignified presence. You are the Researcher—silent, determined, and drawn to hidden knowledge. While generous, you are fickle-minded and highly proficient in fine arts or specialized research."
},
{
"Lagna (Ascendant)": "Sagittarius",
"Ruling Planet": "Jupiter",
"Interpretation": "You are ruled by Jupiter, appearing with a tall, athletic build and a cheerful, broad forehead. You are the Explorer—optimistic, philosophical, and freedom-loving. You are a seeker of higher spiritual growth and occult philosophy, always looking toward the horizon of knowledge."
},
{
"Lagna (Ascendant)": "Capricorn",
"Ruling Planet": "Saturn",
"Interpretation": "You are ruled by Saturn, possessing a lean build and a serious, disciplined posture. You are the Builder—ambitious, practical, and focused on achievement. You possess immense perseverance and a stoical attitude toward life's miseries, valuing long-term goals and responsibility."
},
{
"Lagna (Ascendant)": "Aquarius",
"Ruling Planet": "Saturn",
"Interpretation": "You are ruled by Saturn, with distinctive, fairly handsome features and a thoughtful gaze. You are the Visionary—innovative, humanitarian, and highly intuitive. You shine as a spokesperson for reform, though you may occasionally struggle with emotional detachment or a sense of loneliness."
},
{
"Lagna (Ascendant)": "Pisces",
"Ruling Planet": "Jupiter",
"Interpretation": "You are ruled by Jupiter, appearing with gentle features and dreamy, compassionate eyes. You are the Dreamer—imaginative, empathetic, and spiritual. While you are a true friend and ambitious to exercise authority, you often seek emotional transcendence and spiritual clarity."
}
]