[
  {
    "Planet": "Sun",
    "Duration": 6,
    "Interpretation": "You are currently in a cycle that focuses on self-confidence, authority, and career recognition. This is a time for you to step into leadership roles and earn respect from your superiors. While your vitality is high, you must guard against ego conflicts and pay attention to your physical heart and eyes. You may find that your relationship with father figures or government authorities becomes a major theme."
  },
  {
    "Planet": "Moon",
    "Duration": 10,
    "Interpretation": "You have entered a period where your emphasis shifts toward emotions, home life, and nurturing. You are likely to find happiness through family and domestic peace, and your intuition is at its peak. It is a favorable time for property gains, though you may experience fluctuating moods and concerns regarding your mother. Travel or a sense of inner restlessness may also define this phase."
  },
  {
    "Planet": "Mars",
    "Duration": 7,
    "Interpretation": "You are experiencing an action-oriented phase filled with energy and courage. You feel a strong drive to take the initiative, which can lead to competitive success and gains through property or siblings. However, you must manage your impatience to avoid arguments or accidents. Be careful not to let your assertive nature turn into unnecessary disputes or friction with those close to you."
  },
  {
    "Planet": "Rahu",
    "Duration": 18,
    "Interpretation": "You are navigating a long cycle driven by growth, change, and material ambitions. This period often brings sudden opportunities, foreign travel, or wealth through unconventional means. Because Rahu can create illusions, you may face moments of confusion or unexpected obstacles. Focus on staying grounded to prevent your ambitions from leading to mental strain or health issues."
  },
  {
    "Planet": "Jupiter",
    "Duration": 16,
    "Interpretation": "You are in a major cycle of wisdom, expansion, and blessings. This is one of the most favorable times for you to gain knowledge, experience financial growth, and deepen your spirituality. You may receive significant guidance from mentors or see progress regarding children. Your main challenge is to avoid over-optimism and to manage your physical health, as this period can lead to over-indulgence."
  },
  {
    "Planet": "Saturn",
    "Duration": 19,
    "Interpretation": "You are moving through a cycle that demands discipline, hard work, and patience. This is a time for building stability and achieving career highs through persistent effort. While long-term rewards are promised, you may face delays, a sense of isolation, or heavy responsibilities. Focus on your structural health, such as bones and joints, and remember that the pressure you feel now is refining your character for future success."
  },
  {
    "Planet": "Mercury",
    "Duration": 17,
    "Interpretation": "You are in a phase focused on communication, intellect, and skill-building. Your wit and learning abilities are sharp, making this an excellent time for business success and intellectual pursuits. You likely feel supported by friends and siblings. Your challenge will be managing nervous energy or indecisiveness; stay focused to avoid letting your mind wander into anxiety or skin-related sensitivities."
  },
  {
    "Planet": "Ketu",
    "Duration": 7,
    "Interpretation": "You have entered a spiritual cycle characterized by detachment and inner insight. This is a time where your intuition is very strong, and you may feel drawn to pilgrimages or seeking liberation from material ties. Because this is a period of 'letting go,' you might face feelings of isolation or uncertainty in worldly matters. Embrace the spiritual growth, but stay cautious to avoid accidents or sudden losses."
  },
  {
    "Planet": "Venus",
    "Duration": 20,
    "Interpretation": "You are in a beautiful cycle emphasizing relationships, luxury, and creativity. This is a prime time for marriage, romance, and artistic expression. You are likely to enjoy comforts like new vehicles and a sense of wealth. However, you must be careful not to over-indulge in pleasures or overspend. Keep a balance in your relationships to ensure that your pursuit of comfort doesn't lead to emotional strain."
  }
]