[
{
"Moon Rasi (Sign)": "Aries",
"Ruling Planet": "Mars",
"Interpretation": "You possess a Moon ruled by Mars, making you impulsive and action-oriented. You have a restless mind, a courageous spirit, and a high degree of self-respect. You are ambitious but must manage a quick temper and a tendency to decide things too hastily."
},
{
"Moon Rasi (Sign)": "Taurus",
"Ruling Planet": "Venus",
"Interpretation": "Your Moon is ruled by Venus, making you emotionally stable, liberal, and powerful. You possess sound judgment and find emotional security in luxury and the arts. You are generally influential and loyal, finding your greatest peace in material stability."
},
{
"Moon Rasi (Sign)": "Gemini",
"Ruling Planet": "Mercury",
"Interpretation": "Your Moon is ruled by Mercury, making you witty, well-read, and a powerful speaker. You are a creative thinker with a keen perception of others' motives. Your restless mind is fond of music and intellectual pursuits, though you may struggle with indecisiveness."
},
{
"Moon Rasi (Sign)": "Cancer",
"Ruling Planet": "Moon",
"Interpretation": "Your Moon is in its own sign, making you deeply intuitive, wise, and sensitive. You are a meditative soul who finds great comfort in routine and family. You are compassionate and protective, often improving your social status through your own dedicated efforts."
},
{
"Moon Rasi (Sign)": "Leo",
"Ruling Planet": "Sun",
"Interpretation": "Your Moon is ruled by the Sun, making you bold, generous, and aristocratic. You have fixed principles and a noble spirit, though you crave recognition. You love luxuries and fine arts, but you may occasionally suffer from mental anxiety or pride."
},
{
"Moon Rasi (Sign)": "Virgo",
"Ruling Planet": "Mercury",
"Interpretation": "Your Moon is ruled by Mercury, making you modest, virtuous, and acutely insightful. You have a persuasive tongue and a heart dedicated to being a benefactor to others. You are highly skilled in organized efforts and find comfort in health and routine."
},
{
"Moon Rasi (Sign)": "Libra",
"Ruling Planet": "Venus",
"Interpretation": "Your Moon is ruled by Venus, making you principled, just, and business-like. You have a deep reverence for learned people and value harmony in all dealings. While you are amicable and intelligent, you may sometimes feel a lack of ambition in material pursuits."
},
{
"Moon Rasi (Sign)": "Scorpio",
"Ruling Planet": "Mars",
"Interpretation": "Your Moon is ruled by Mars, making you straightforward, frank, and open-minded. You are a resilient soul with intense, private emotions. While you are determined and magnetic, you must guard against an agitated mind or volatile emotions."
},
{
"Moon Rasi (Sign)": "Sagittarius",
"Ruling Planet": "Jupiter",
"Interpretation": "Your Moon is ruled by Jupiter, making you optimistic, philosophical, and upright. You have high moral standards and a deep, inventive intellect. You are a patron of the arts and literature with a happy, ceremonial-minded disposition."
},
{
"Moon Rasi (Sign)": "Capricorn",
"Ruling Planet": "Saturn",
"Interpretation": "Your Moon is ruled by Saturn, linking your emotional life to responsibility and achievement. You are disciplined, practical, and attached to your family. You seek security through status, though you may appear emotionally reserved or distant."
},
{
"Moon Rasi (Sign)": "Aquarius",
"Ruling Planet": "Saturn",
"Interpretation": "Your Moon is ruled by Saturn, making you artistic, intuitive, and humanitarian. You seek mental stimulation and are broad-minded, though you may feel emotionally detached from your surroundings or prone to occasional loneliness."
},
{
"Moon Rasi (Sign)": "Pisces",
"Ruling Planet": "Jupiter",
"Interpretation": "Your Moon is ruled by Jupiter, making you highly empathetic, imaginative, and spiritual. You are a steady, learned soul who is fond of family and music. You are often deeply compassionate and become more spiritually inclined as you age."
}
]