{
  "Sunapha Yoga": "Planets (except the Sun) occupy the 2nd house from the Moon. This indicates a self-made individual who acquires wealth and status through their own intelligence and effort. It grants a steady mind and a highly respected position.",
  "Anapha Yoga": "Planets (except the Sun) occupy the 12th house from the Moon. It blesses you with a majestic appearance, a strong sense of morality, and a reputation that grows with age. You are likely to be fond of refined pleasures and gain renown.",
  "Durdhura Yoga": "Planets occupy both the 2nd and 12th houses from the Moon. This is a powerful combination for worldly success, giving you access to all comforts, vehicles, and a generous, commanding personality.",
  "Adhi Yoga": "Benefics occupy the 6th, 7th, and 8th houses from the Moon. This makes the native a leader, minister, or commander; it bestows a long life free from major diseases and a temperament that is naturally victorious over obstacles.",
  "Gaja Kesari Yoga": "Jupiter is in a quadrant (1st, 4th, 7th, or 10th) from the Moon. It signifies great wisdom, lasting fame, and the power to overcome competitors. You are likely to hold a position of high respect.",
  "Chamara Yoga": "The lord of the Ascendant is exalted in a quadrant with Jupiter's aspect. This produces a profound scholar and a good conversationalist who is greatly respected by the elite and lives a long, virtuous life.",
  "Shankha Yoga": "Lords of the 5th and 6th are in mutual quadrants and the lord of the Ascendant is powerful. This results in a philanthropic nature, being well-versed in sciences, and enjoying a happy family life.",
  "Sreenatha Yoga": "The exalted lord of the 7th occupies the 10th with the lords of the 9th and 10th. This brings great reputation, wealth, and an honorable lifestyle in very pleasant surroundings.",
  "Bheri Yoga": "The lord of the 9th is powerful and the lord of the Ascendant and Venus are in quadrants from Jupiter. It results in an exalted soul, expert in arts and sciences, and a heart dedicated to high family traditions.",
  "Gnana Yoga": "A specific combination of Mercury and Jupiter that indicates a seeker of truth. You possess a natural pull toward deep philosophy and are respected for your spiritual wisdom.",
  "Kemadruma Yoga": "No planets are in the 2nd or 12th houses from the Moon. This suggests a journey where you must rely solely on your inner strength; it challenges you to find spiritual wealth over material reliance.",
  "Vesi Yoga": "Planets (except the Moon) in the 2nd from the Sun. This makes one a balanced speaker, truthful, and possessed of a wide perspective on life.",
  "Vasi Yoga": "Planets (except the Moon) in the 12th from the Sun. This grants a person an influential personality and a charitable disposition.",
  "Lakshmi Yoga": "The lord of the 9th occupies a quadrant and the lord of the Ascendant is powerful. This results in a person of high integrity, great wealth, and noble virtues, often honored by the state.",
  "Dhana Yoga": "A favorable connection between the houses of wealth (2nd) and gains (11th). This indicates steady financial success and the ability to accumulate assets throughout life."
}